package thisisjava.practice.p_250304;

public class P_250304_1 {

	// 1. 프로그램 : 컴퓨터에서 실행되는 명령문
	// 2. 프로그램 실행 : 프로그래밍 언어로 작성된 언어를 컴퓨터가 실행하는 것
	// 3. 컴퓨터 프로그램 : 컴퓨터가 특정 작업을 수행하기 위해 따르는 지침
	// 4. 프로그램 언어 : 기계어와 자연어를 이어주는 도구
	// 5. 소프트웨어 : 컴퓨터등의 장비에서 하드웨어에서 구동되거나 처리되는 것
	// 6. 코드 : 컴퓨터가 인간의 말을 이해할 수 있도록 작성된 명령어
	// 7. 코딩 : 프로그래밍 언어를 이용해 코드를 작성하는 것
	// 8. 프로그래머 : 프로그램을 작성하거나 연구하는 사람
	// 9. 하드웨어 : 소프트웨어를 구동하는데 필요한 물리적인 구성 요소
	// 10. 고급언어, 저급언어 : 고급언어는 자연어에 가까운 프로그래밍 언어이고, 저급언어는 기계어에 가까운 프로그래밍 언어이다.
	// 11. 컴파일러 : 작성된 소스를 컴퓨터가 이해할 수 있도록 기계어로 바꾸는 작업
	// 12. 버그 : 소프트웨어 작동시 예기치 못하게 일어나는 오류
	// 13. 디버그, 디버깅 : 발생한 버그를 찾고 수정하는 작업

}
